import React from 'react';

const SecuritySection: React.FC = () => {
  return (
    <div className="bg-neutral-925 py-16">
      <div className="container mx-auto px-4">
        <div className="text-center mb-12">
          <h2 className="text-3xl font-bold text-white mb-4">🛡️ Наша безопасность</h2>
          <p className="text-gray-300 text-lg max-w-3xl mx-auto">
            Ваши биты в полной безопасности. Мы заботимся о защите вашего творчества от несанкционированного использования.
          </p>
          <hr className='text-red-500 my-4 mx-auto border max-w-200'/>
        </div>

        <div className="max-w-4xl mx-auto">
          <div className="bg-neutral-800 rounded-xl p-8 border border-neutral-700">
            <div className="text-center mb-6">
              <div className="text-4xl mb-4">🔒</div>
              <h3 className="text-white font-semibold text-2xl mb-4">Защита от кражи и копирования</h3>
            </div>
            <p className="text-gray-300 text-lg leading-relaxed mb-6">
                Не беспокойтесь, если кто-то скачает ваш бит и попытается продать его за деньги или использовать без вашего разрешения. У нас есть собственная система защиты, которая предотвращает такие случаи.
            </p>
            <p className="text-gray-300 text-lg leading-relaxed mb-6">
                Наша технология анализирует каждый загруженный файл: каждый бит преобразуется в компактный цифровой "паспорт". Этот процесс происходит мгновенно и позволяет быстро сравнивать биты между собой.
            </p>
            <p className="text-gray-300 text-lg leading-relaxed">
                Благодаря этой системе мы гарантируем оригинальность контента и защищаем права создателей. Ваше творчество остается вашим, и мы не позволим его использовать без вашего согласия.
            </p>
          </div>
        </div>
      </div>
    </div>
  );
};

export default SecuritySection;
